app/Models/Promo3Model.php

    public function get_datatable_data(int $limit = 0, int $offset = 0, string $orderby = null, string $orderdir = 'ASC', string $search = null)
    {
        $dataset = $this;

        $dataset->select('id, username, vip_level, prize, status, claim_date, for_date, created_at, updated_at');

        if ($search != null) {
            $dataset->groupStart();
            $dataset->like('id', $search);
            $dataset->orLike('username', $search);
            $dataset->orLike('vip_level', $search);
            $dataset->orLike('prize', $search);
            $dataset->orLike('status', $search);
            $dataset->orLike('claim_date', $search);
            $dataset->orLike('for_date', $search);
            $dataset->orLike('created_at', $search);
            $dataset->groupEnd();
        }
        $dataset->where('deleted_at', null);
        $dataset->orderBy($orderby, strtoupper($orderdir));

        return [
            'data' => $dataset->findAll($limit, $offset),
            'recordsFiltered' => $this->get_datatable_recordsFiltered($search),
            //total filtered data for paging
            'recordsTotal' => $this->countAll(), //total of all records in table
        ];
---
SELECT `id`, `username`, `vip_level`, `prize`, `status`, `claim_date`, `for_date`, `created_at`, `updated_at`
FROM `promo_3`
WHERE `deleted_at` IS NULL
ORDER BY `prize` DESC
 LIMIT 50
SELECT COUNT(*) AS `numrows` FROM `promo_3`

    private function get_datatable_recordsFiltered(string $search)
    {
        $dataset = $this;
        if ($search != null) {
            $dataset->groupStart();
            $dataset->like('id', $search);
            $dataset->orLike('username', $search);
            $dataset->orLike('vip_level', $search);
            $dataset->orLike('prize', $search);
            $dataset->orLike('status', $search);
            $dataset->orLike('for_date', $search);
            $dataset->orLike('claim_date', $search);
            $dataset->orLike('created_at', $search);
            $dataset->groupEnd();
        }
        $dataset->where('deleted_at', null);
        return $dataset->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `promo_3`
WHERE `deleted_at` IS NULL

    public function download_csv(array $data = [])
    {
        $dataset = $this;
        $dataset->select('username, vip_level, prize, status, claim_date');
        $dataset->where('status', $data['status']);
        $dataset->where($data['dtype'] . '>=', $data['start_date']);
        $dataset->where($data['dtype'] . '<=', $data['end_date']);

        return $dataset->findAll();
---
SELECT `username`, `vip_level`, `prize`, `status`, `claim_date`
FROM `promo_3`
WHERE `status` = '已派送'
AND `claim_date` >= '2023-08-07 00:00:00'
AND `claim_date` <= '2023-09-30 23:59:59'