app/Models/Userinfo8167Model.php

    public function get_datatable_data(int $limit = 0, int $offset = 0, string $orderby = null, string $orderdir = 'ASC', string $search = null )
    {
        $dataset = $this;

        $dataset->select('id, username, total_bet, vip_level, created_at, updated_at');

        if($search != null)
        {
            $dataset->groupStart();
            $dataset->like('id', $search);
            $dataset->orLike('username', $search);
            $dataset->orLike('total_bet', $search);
            $dataset->orLike('vip_level', $search);
            $dataset->orLike('created_at', $search);
            $dataset->orLike('updated_at', $search);
            $dataset->groupEnd();
        }
        $dataset->where('deleted_at', null);
        $dataset->orderBy( $orderby, strtoupper($orderdir) );

        return [
            'data' => $dataset->findAll($limit, $offset),
            'recordsFiltered' => $this->get_datatable_recordsFiltered($search), //total filtered data for paging
            'recordsTotal' => $this->countAll(), //total of all records in table
        ];
---
SELECT `id`, `username`, `total_bet`, `vip_level`, `created_at`, `updated_at`
FROM `userinfo_8167`
WHERE `deleted_at` IS NULL
ORDER BY `total_bet` DESC
 LIMIT 50
SELECT COUNT(*) AS `numrows` FROM `userinfo_8167`

    private function get_datatable_recordsFiltered(string $search)
    {
        $dataset = $this;
        if($search != null)
        {
            $dataset->groupStart();
            $dataset->like('id', $search);
            $dataset->orLike('username', $search);
            $dataset->orLike('total_bet', $search);
            $dataset->orLike('vip_level', $search);
            $dataset->orLike('created_at', $search);
            $dataset->orLike('updated_at', $search);
            $dataset->groupEnd();
        }
        $dataset->where('deleted_at', null);
        return $dataset->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `userinfo_8167`
WHERE `deleted_at` IS NULL